app/Controllers/AdminController.php

    public function dashboard()
    {
        // Get current date for filtering
        $today = date('Y-m-d');

        // Calculate total revenue (sum of all paid bills)
        $totalRevenue = $this->billModel->selectSum('amount', 'total_amount')
            ->where('status', 'paid')
            ->get()
            ->getRow()
            ->total_amount ?? 0;

        // Get pending appointments count
        $pendingAppointments = $this->appointmentModel
            ->where('status', 'pending')
            ->countAllResults();

        // Get recent patients (last 5 registered)
        $recentPatients = $this->patientModel
            ->select('patients.*')
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->find();

        // Prepare data for the view
        $data = [
            'totalPatients' => $this->patientModel->countAllResults(),
            'todayAppointments' => $this->appointmentModel
                ->where('date', $today)
                ->countAllResults(),
            'pendingAppointments' => $pendingAppointments,
            'totalRevenue' => $totalRevenue,
            'recentPatients' => $recentPatients,
            'recentAppointments' => $this->appointmentModel
                ->select('appointments.*, patients.name as patient_name')
                ->join('patients', 'patients.id = appointments.patient_id')
                ->orderBy('appointments.date', 'DESC')
                ->orderBy('appointments.time', 'DESC')
                ->limit(5)
                ->find()
---
SELECT SUM(`amount`) AS `total_amount`
FROM `bills`
WHERE `status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'pending'
SELECT `patients`.*
FROM `patients`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `date` = '2025-12-02'
SELECT `appointments`.*, `patients`.`name` as `patient_name`
FROM `appointments`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
ORDER BY `appointments`.`date` DESC, `appointments`.`time` DESC
 LIMIT 5