app/Controllers/DoctorController.php

SELECT *
FROM `staff`
WHERE `email` = 'doctor@gmail.com'
 LIMIT 1
SELECT COUNT(DISTINCT patient_id) as total_patients
FROM `appointments`
WHERE `doctor` = 'doc ko '
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `doctor` = 'doc ko '
AND `date` >= '2025-12-02'
AND `status` = 'scheduled'
---
    public function dashboard()
    {
        $userId = $this->session->get('id');

        // Get doctor's name to use for filtering appointments
        $doctorName = $this->session->get('name');

        // Get staff ID for prescriptions (prescriptions table uses doctor_id foreign key to staff.id)
        $staffModel = new \App\Models\StaffModel();
        $staff = $staffModel->where('email', $this->session->get('email'))->first();
        $doctorStaffId = $staff ? $staff['id'] : null;

        // Get total unique patients for the doctor by checking appointments
        $totalPatients = $this->appointmentModel
            ->select('COUNT(DISTINCT patient_id) as total_patients')
            ->where('doctor', $doctorName)
            ->get()
            ->getRow()
            ->total_patients ?? 0;

        // Get upcoming appointments (today and future)
        $upcomingAppointments = $this->appointmentModel
            ->where('doctor', $doctorName)
            ->where('date >=', date('Y-m-d'))
            ->where('status', 'scheduled')
            ->countAllResults();

SELECT *
FROM `appointments`
WHERE `doctor` = 'doc ko '
AND `date` = '2025-12-02'
AND `status` IN ('scheduled','in-progress')
ORDER BY `time` ASC
---
            ->countAllResults() : 0;

        // Get today's appointments
        $todayAppointments = $this->appointmentModel
            ->where('doctor', $doctorName)
            ->where('date', date('Y-m-d'))
            ->whereIn('status', ['scheduled', 'in-progress'])
            ->orderBy('time', 'ASC')
            ->findAll();

SELECT *
FROM `medicines`
WHERE `status` = 'active'
---
    public function createPrescription()
    {
        $data['patients'] = $this->patientModel->getPatients(1000);
        $data['appointments'] = $this->appointmentModel->getAppointments();
        $data['medicines'] = $this->medicineModel->where('status', 'active')->findAll();

SELECT *
FROM `lab_requests`
WHERE `lab_requests`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function lab()
    {
        $userRole = session()->get('role');
        $labRequestModel = new \App\Models\LabRequestModel();

        if ($userRole === 'lab_technician' || $userRole === 'laboratory_staff') {
            // Lab staff see all requests
            $labSupplyModel = new \App\Models\LabSupplyModel();
            $labResultModel = new \App\Models\LabResultModel();

            // Get all requests (simple query since lab_requests table only has patient and test as varchar)
            $data['requests'] = $labRequestModel
                ->orderBy('created_at', 'DESC')
                ->findAll();