app/Controllers/LabController.php

    public function results()
    {
        $labResultModel = new LabResultModel();
        $data['results'] = $labResultModel->findAll();
---
SELECT *
FROM `lab_results`
WHERE `lab_results`.`deleted_at` IS NULL

    public function viewRequest($id)
    {
        $labRequestModel = new LabRequestModel();
        $request = $labRequestModel->find($id);
---
SELECT *
FROM `lab_requests`
WHERE `lab_requests`.`deleted_at` IS NULL
AND `lab_requests`.`id` = '1'