app/Controllers/LaboratoryStaffController.php

    public function results()
    {
        if (!$this->checkAuth()) {
            return redirect()->to('/login');
        }

        $data['results'] = $this->resultModel->findAll();
---
SELECT *
FROM `lab_results`
WHERE `lab_results`.`deleted_at` IS NULL