app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'kobe@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session   = session();
        $userModel = new UserModel();

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $role     = $this->request->getPost('role');


        $normalizedRole = str_replace(' ', '_', strtolower($role));

        $user = $userModel->where('email', $email)->first();