app/Controllers/NurseController.php

    public function appointments()
    {
        $perPage = 10;
        $page = $this->request->getVar('page') ?? 1;

        $data = [
            'appointments' => $this->appointmentModel
                ->select('appointments.*, patients.name as patient_name')
                ->join('patients', 'patients.id = appointments.patient_id')
                ->orderBy('appointments.date', 'DESC')
                ->orderBy('appointments.time', 'DESC')
                ->paginate($perPage),
            'pager' => $this->appointmentModel->pager,
            'currentPage' => $page,
            'perPage' => $perPage,
            'total' => $this->appointmentModel->countAllResults()
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
SELECT COUNT(*) AS `numrows`
FROM `appointments`

    public function medications()
    {
        $prescriptions = $this->prescriptionModel
            ->select('prescriptions.*, patients.name as patient_name, patients.age')
            ->join('patients', 'patients.id = prescriptions.patient_id')
            ->orderBy('prescriptions.prescription_date', 'DESC')
            ->findAll();
---
SELECT `prescriptions`.*, `patients`.`name` as `patient_name`, `patients`.`age`
FROM `prescriptions`
JOIN `patients` ON `patients`.`id` = `prescriptions`.`patient_id`
ORDER BY `prescriptions`.`prescription_date` DESC