app/Models/AppointmentModel.php

    public function getAppointments($limit = 10, $offset = 0)
    {
        return $this->select('appointments.*, patients.name as patient_name, patients.contact')
                    ->join('patients', 'patients.id = appointments.patient_id')
                    ->orderBy('appointments.date', 'DESC')
                    ->orderBy('appointments.time', 'DESC')
                    ->findAll($limit, $offset);
---
SELECT `appointments`.*, `patients`.`name` as `patient_name`, `patients`.`contact`
FROM `appointments`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
ORDER BY `appointments`.`date` DESC, `appointments`.`time` DESC
 LIMIT 10

    public function getAppointment($id)
    {
        return $this->select('appointments.*, patients.name as patient_name, patients.contact, patients.age, patients.gender')
                    ->join('patients', 'patients.id = appointments.patient_id')
                    ->find($id);
---
SELECT `appointments`.*, `patients`.`name` as `patient_name`, `patients`.`contact`, `patients`.`age`, `patients`.`gender`
FROM `appointments`
JOIN `patients` ON `patients`.`id` = `appointments`.`patient_id`
WHERE `appointments`.`id` = '11'
 LIMIT 1