app/Models/BillModel.php

SELECT `bills`.*, `patients`.`name` as `patient_name`, `patients`.`contact`
FROM `bills`
JOIN `patients` ON `patients`.`id` = `bills`.`patient_id`
ORDER BY `bills`.`created_at` DESC
 LIMIT 10
---
    public function getBills($limit = 10, $offset = 0)
    {
        return $this->select('bills.*, patients.name as patient_name, patients.contact')
                    ->join('patients', 'patients.id = bills.patient_id')
                    ->orderBy('bills.created_at', 'DESC')
                    ->findAll($limit, $offset);

SELECT COUNT(*) AS `numrows` FROM `bills`
---
    public function getTotalBills()
    {
        return $this->countAll();

SELECT SUM(`amount`) AS `amount`
FROM `bills`
WHERE `status` = 'paid'
---
    public function getTotalRevenue()
    {
        return $this->where('status', 'paid')->selectSum('amount')->get()->getRow()->amount ?? 0;

SELECT COUNT(*) AS `numrows`
FROM `bills`
WHERE `status` IN ('unpaid','pending')
---
    public function getPendingPaymentsCount()
    {
        return $this->whereIn('status', ['unpaid', 'pending'])->countAllResults();