app/Models/PatientModel.php

SELECT *
FROM `patients`
 LIMIT 10
---
    public function getPatients($limit = 10, $offset = 0)
    {
        return $this->findAll($limit, $offset);