app/Models/PatientModel.php

    public function getPatients($search = null, $limit = null, $offset = null)
    {
        $builder = $this->builder();

        if ($search) {
            $builder->groupStart()
                    ->like('first_name', $search)
                    ->orLike('last_name', $search)
                    ->orLike('patient_id', $search)
                    ->orLike('contact_number', $search)
                    ->groupEnd();
        }

        if ($limit) {
            $builder->limit($limit, $offset);
        }

        return $builder->get()->getResultArray();
---
SELECT *
FROM `patients`
 LIMIT 1000

    public function getTotalPatients()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `patients`