app/Models/UserModel.php

    public function findByEmail(string $email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'buhisanerica@gmail.com'
 LIMIT 1